MikroElektronika/core_packages/PIC/XC8/def/PIC18LF44K22/mcu.h
extern volatile BAUD1CONbits_t BAUD1CONbits __at(0xFB8);
// bitfield macros
#define _BAUD1CON_ABDEN_POSN                                0x0
#define _BAUD1CON_ABDEN_POSITION                            0x0
#define _BAUD1CON_ABDEN_SIZE                                0x1
#define _BAUD1CON_ABDEN_LENGTH                              0x1
#define _BAUD1CON_ABDEN_MASK                                0x1
#define _BAUD1CON_WUE_POSN                                  0x1
#define _BAUD1CON_WUE_POSITION                              0x1
#define _BAUD1CON_WUE_SIZE                                  0x1
#define _BAUD1CON_WUE_LENGTH                                0x1
#define _BAUD1CON_WUE_MASK                                  0x2
#define _BAUD1CON_BRG16_POSN                                0x3
#define _BAUD1CON_BRG16_POSITION                            0x3
#define _BAUD1CON_BRG16_SIZE                                0x1
#define _BAUD1CON_BRG16_LENGTH                              0x1
#define _BAUD1CON_BRG16_MASK                                0x8
#define _BAUD1CON_CKTXP_POSN                                0x4
#define _BAUD1CON_CKTXP_POSITION                            0x4
#define _BAUD1CON_CKTXP_SIZE                                0x1
#define _BAUD1CON_CKTXP_LENGTH                              0x1
#define _BAUD1CON_CKTXP_MASK                                0x10
#define _BAUD1CON_DTRXP_POSN                                0x5
#define _BAUD1CON_DTRXP_POSITION                            0x5
#define _BAUD1CON_DTRXP_SIZE                                0x1
#define _BAUD1CON_DTRXP_LENGTH                              0x1
#define _BAUD1CON_DTRXP_MASK                                0x20
#define _BAUD1CON_RCIDL_POSN                                0x6
#define _BAUD1CON_RCIDL_POSITION                            0x6
#define _BAUD1CON_RCIDL_SIZE                                0x1
#define _BAUD1CON_RCIDL_LENGTH                              0x1
#define _BAUD1CON_RCIDL_MASK                                0x40
#define _BAUD1CON_ABDOVF_POSN                               0x7
#define _BAUD1CON_ABDOVF_POSITION                           0x7
#define _BAUD1CON_ABDOVF_SIZE                               0x1
#define _BAUD1CON_ABDOVF_LENGTH                             0x1
#define _BAUD1CON_ABDOVF_MASK                               0x80
#define _BAUD1CON_SCKP_POSN                                 0x4
#define _BAUD1CON_SCKP_POSITION                             0x4
#define _BAUD1CON_SCKP_SIZE                                 0x1
#define _BAUD1CON_SCKP_LENGTH                               0x1
#define _BAUD1CON_SCKP_MASK                                 0x10
#define _BAUD1CON_ABDEN1_POSN                               0x0
#define _BAUD1CON_ABDEN1_POSITION                           0x0
#define _BAUD1CON_ABDEN1_SIZE                               0x1
#define _BAUD1CON_ABDEN1_LENGTH                             0x1
#define _BAUD1CON_ABDEN1_MASK                               0x1
#define _BAUD1CON_WUE1_POSN                                 0x1
#define _BAUD1CON_WUE1_POSITION                             0x1
#define _BAUD1CON_WUE1_SIZE                                 0x1
#define _BAUD1CON_WUE1_LENGTH                               0x1
#define _BAUD1CON_WUE1_MASK                                 0x2
#define _BAUD1CON_BRG161_POSN                               0x3
#define _BAUD1CON_BRG161_POSITION                           0x3
#define _BAUD1CON_BRG161_SIZE                               0x1
#define _BAUD1CON_BRG161_LENGTH                             0x1
#define _BAUD1CON_BRG161_MASK                               0x8
#define _BAUD1CON_SCKP1_POSN                                0x4
#define _BAUD1CON_SCKP1_POSITION                            0x4
#define _BAUD1CON_SCKP1_SIZE                                0x1
#define _BAUD1CON_SCKP1_LENGTH                              0x1
#define _BAUD1CON_SCKP1_MASK                                0x10
#define _BAUD1CON_DTRXP1_POSN                               0x5
#define _BAUD1CON_DTRXP1_POSITION                           0x5
#define _BAUD1CON_DTRXP1_SIZE                               0x1
#define _BAUD1CON_DTRXP1_LENGTH                             0x1
#define _BAUD1CON_DTRXP1_MASK                               0x20
#define _BAUD1CON_RCIDL1_POSN                               0x6
#define _BAUD1CON_RCIDL1_POSITION                           0x6
#define _BAUD1CON_RCIDL1_SIZE                               0x1
#define _BAUD1CON_RCIDL1_LENGTH                             0x1
#define _BAUD1CON_RCIDL1_MASK                               0x40
#define _BAUD1CON_ABDOVF1_POSN                              0x7
#define _BAUD1CON_ABDOVF1_POSITION                          0x7
#define _BAUD1CON_ABDOVF1_SIZE                              0x1
#define _BAUD1CON_ABDOVF1_LENGTH                            0x1
#define _BAUD1CON_ABDOVF1_MASK                              0x80
#define _BAUD1CON_TXCKP_POSN                                0x4
#define _BAUD1CON_TXCKP_POSITION                            0x4
#define _BAUD1CON_TXCKP_SIZE                                0x1
#define _BAUD1CON_TXCKP_LENGTH                              0x1
#define _BAUD1CON_TXCKP_MASK                                0x10
#define _BAUD1CON_RXDTP_POSN                                0x5
#define _BAUD1CON_RXDTP_POSITION                            0x5
#define _BAUD1CON_RXDTP_SIZE                                0x1
#define _BAUD1CON_RXDTP_LENGTH                              0x1
#define _BAUD1CON_RXDTP_MASK                                0x20
#define _BAUD1CON_RCMT_POSN                                 0x6
#define _BAUD1CON_RCMT_POSITION                             0x6
#define _BAUD1CON_RCMT_SIZE                                 0x1
#define _BAUD1CON_RCMT_LENGTH                               0x1
#define _BAUD1CON_RCMT_MASK                                 0x40
#define _BAUD1CON_TXCKP1_POSN                               0x4
#define _BAUD1CON_TXCKP1_POSITION                           0x4
#define _BAUD1CON_TXCKP1_SIZE                               0x1
#define _BAUD1CON_TXCKP1_LENGTH                             0x1
#define _BAUD1CON_TXCKP1_MASK                               0x10
#define _BAUD1CON_RXDTP1_POSN                               0x5
#define _BAUD1CON_RXDTP1_POSITION                           0x5
#define _BAUD1CON_RXDTP1_SIZE                               0x1
#define _BAUD1CON_RXDTP1_LENGTH                             0x1
#define _BAUD1CON_RXDTP1_MASK                               0x20
#define _BAUD1CON_RCMT1_POSN                                0x6
#define _BAUD1CON_RCMT1_POSITION                            0x6
#define _BAUD1CON_RCMT1_SIZE                                0x1
#define _BAUD1CON_RCMT1_LENGTH                              0x1
#define _BAUD1CON_RCMT1_MASK                                0x40
#define _BAUD1CON_RXCKP_POSN                                0x5
#define _BAUD1CON_RXCKP_POSITION                            0x5
#define _BAUD1CON_RXCKP_SIZE                                0x1
#define _BAUD1CON_RXCKP_LENGTH                              0x1
#define _BAUD1CON_RXCKP_MASK                                0x20
#define _BAUD1CON_W4E_POSN                                  0x1
#define _BAUD1CON_W4E_POSITION                              0x1
#define _BAUD1CON_W4E_SIZE                                  0x1
#define _BAUD1CON_W4E_LENGTH                                0x1
#define _BAUD1CON_W4E_MASK                                  0x2

// Register: PSTR1CON
#define PSTR1CON PSTR1CON
extern volatile unsigned char           PSTR1CON            __at(0xFB9);
#ifndef _LIB_BUILD
asm("PSTR1CON equ 0FB9h");
#endif
// aliases
extern volatile unsigned char           PSTRCON             __at(0xFB9);
#ifndef _LIB_BUILD
asm("PSTRCON equ 0FB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STR1A                  :1;
        unsigned STR1B                  :1;
        unsigned STR1C                  :1;
        unsigned STR1D                  :1;
        unsigned STR1SYNC               :1;
    };
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned STRSYNC                :1;
    };
} PSTR1CONbits_t;
extern volatile PSTR1CONbits_t PSTR1CONbits __at(0xFB9);
// bitfield macros
#define _PSTR1CON_STR1A_POSN                                0x0
#define _PSTR1CON_STR1A_POSITION                            0x0
#define _PSTR1CON_STR1A_SIZE                                0x1
#define _PSTR1CON_STR1A_LENGTH                              0x1
#define _PSTR1CON_STR1A_MASK                                0x1
#define _PSTR1CON_STR1B_POSN                                0x1
#define _PSTR1CON_STR1B_POSITION                            0x1
#define _PSTR1CON_STR1B_SIZE                                0x1
#define _PSTR1CON_STR1B_LENGTH                              0x1
#define _PSTR1CON_STR1B_MASK                                0x2
#define _PSTR1CON_STR1C_POSN                                0x2
#define _PSTR1CON_STR1C_POSITION                            0x2
#define _PSTR1CON_STR1C_SIZE                                0x1
#define _PSTR1CON_STR1C_LENGTH                              0x1
#define _PSTR1CON_STR1C_MASK                                0x4
#define _PSTR1CON_STR1D_POSN                                0x3
#define _PSTR1CON_STR1D_POSITION                            0x3
#define _PSTR1CON_STR1D_SIZE                                0x1
#define _PSTR1CON_STR1D_LENGTH                              0x1
#define _PSTR1CON_STR1D_MASK                                0x8
#define _PSTR1CON_STR1SYNC_POSN                             0x4
#define _PSTR1CON_STR1SYNC_POSITION                         0x4
#define _PSTR1CON_STR1SYNC_SIZE                             0x1
#define _PSTR1CON_STR1SYNC_LENGTH                           0x1
#define _PSTR1CON_STR1SYNC_MASK                             0x10
#define _PSTR1CON_STRA_POSN                                 0x0
#define _PSTR1CON_STRA_POSITION                             0x0
#define _PSTR1CON_STRA_SIZE                                 0x1
#define _PSTR1CON_STRA_LENGTH                               0x1
#define _PSTR1CON_STRA_MASK                                 0x1
#define _PSTR1CON_STRB_POSN                                 0x1
#define _PSTR1CON_STRB_POSITION                             0x1
#define _PSTR1CON_STRB_SIZE                                 0x1
#define _PSTR1CON_STRB_LENGTH                               0x1
#define _PSTR1CON_STRB_MASK                                 0x2
#define _PSTR1CON_STRC_POSN                                 0x2
#define _PSTR1CON_STRC_POSITION                             0x2
#define _PSTR1CON_STRC_SIZE                                 0x1
#define _PSTR1CON_STRC_LENGTH                               0x1
#define _PSTR1CON_STRC_MASK                                 0x4
#define _PSTR1CON_STRD_POSN                                 0x3
#define _PSTR1CON_STRD_POSITION                             0x3
#define _PSTR1CON_STRD_SIZE                                 0x1
#define _PSTR1CON_STRD_LENGTH                               0x1
#define _PSTR1CON_STRD_MASK                                 0x8
#define _PSTR1CON_STRSYNC_POSN                              0x4
#define _PSTR1CON_STRSYNC_POSITION                          0x4
#define _PSTR1CON_STRSYNC_SIZE                              0x1
#define _PSTR1CON_STRSYNC_LENGTH                            0x1
#define _PSTR1CON_STRSYNC_MASK                              0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned STR1A                  :1;
        unsigned STR1B                  :1;
        unsigned STR1C                  :1;
        unsigned STR1D                  :1;
        unsigned STR1SYNC               :1;
    };
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned STRSYNC                :1;
    };
} PSTRCONbits_t;
